# IsValidForegroundPatternId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilledRegionType..::..IsValidForegroundPatternId Method
FilledRegionType Class See Also
---
Check if the id is valid for a foreground pattern
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool IsValidForegroundPatternId(
	ElementId patternId
)
```

Visual Basic
---
```text
Public Function IsValidForegroundPatternId ( _
	patternId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidForegroundPatternId(
	ElementId^ patternId
)
```

# ### Parameters
patternId
    Type: Autodesk.Revit.DB..::..ElementId Element id of the FillPatternElement
# ### Return Value
False if in a family, and the id is a FillPatternElement that targets 'Drafting'. True otherwise.
# Remarks
In a family the FillPatternElement must be a 'Drafting' pattern.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace